# GetMassZoneIds Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassGBXMLExportOptions..::..GetMassZoneIds Method
MassGBXMLExportOptions Class See Also
---
Gets a list of mass zones to analyze in the exported gbXML.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<ElementId> GetMassZoneIds()
```

Visual Basic
---
```text
Public Function GetMassZoneIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetMassZoneIds()
```

# ### Return Value
The ids of the mass zone.
# See Also
MassGBXMLExportOptions Class
Autodesk.Revit.DB.Analysis Namespace